; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l23_p23_c23_g23_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(crate-at crate7 warehouse)
	(crate-at crate8 warehouse)
	(crate-at crate9 warehouse)
	(crate-at crate10 warehouse)
	(crate-at crate11 warehouse)
	(crate-at crate12 warehouse)
	(crate-at crate13 warehouse)
	(crate-at crate14 warehouse)
	(crate-at crate15 warehouse)
	(crate-at crate16 warehouse)
	(crate-at crate17 warehouse)
	(crate-at crate18 warehouse)
	(crate-at crate19 warehouse)
	(crate-at crate20 warehouse)
	(crate-at crate21 warehouse)
	(crate-at crate22 warehouse)
	(crate-at crate23 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(person-at person1 loc14)
	(person-at person2 loc2)
	(person-at person3 loc5)
	(person-at person4 loc18)
	(person-at person5 loc6)
	(person-at person6 loc2)
	(person-at person7 loc15)
	(person-at person8 loc6)
	(person-at person9 loc2)
	(person-at person10 loc11)
	(person-at person11 loc23)
	(person-at person12 loc11)
	(person-at person13 loc19)
	(person-at person14 loc5)
	(person-at person15 loc21)
	(person-at person16 loc20)
	(person-at person17 loc7)
	(person-at person18 loc3)
	(person-at person19 loc13)
	(person-at person20 loc17)
	(person-at person21 loc14)
	(person-at person22 loc3)
	(person-at person23 loc10)
	(person-need person1 food)
	(person-need person1 medicine)
	(person-need person2 food)
	(person-need person2 medicine)
	(person-need person3 food)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 food)
	(person-need person6 medicine)
	(person-need person7 food)
	(person-need person7 medicine)
	(person-need person10 medicine)
	(person-need person11 medicine)
	(person-need person12 food)
	(person-need person12 medicine)
	(person-need person14 medicine)
	(person-need person16 medicine)
	(person-need person18 medicine)
	(person-need person20 medicine)
	(person-need person22 food)
	(person-need person22 medicine)
	(person-need person23 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 food)
	(has-content-person person12 medicine)
	(has-content-person person14 medicine)
	(has-content-person person16 medicine)
	(has-content-person person18 medicine)
	(has-content-person person20 medicine)
	(has-content-person person22 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 24
2. (pick-up-crate crate9 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate9 warehouse)
   added: (has-crate-drone-arm drone1 right crate9)
   goals met: 0 of 24
3. (pick-up-crate crate1 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 0 of 24
4. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 0 of 24
5. (drone-move loc14 loc18 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc18)
   goals met: 0 of 24
6. (drop-crate loc18 person4 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate9)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 1 of 24
7. (drone-move loc18 warehouse drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 warehouse)
   goals met: 1 of 24
8. (pick-up-crate crate10 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 warehouse)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 1 of 24
9. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 1 of 24
10. (drone-move loc14 loc6 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc6)
   goals met: 1 of 24
11. (drop-crate loc6 person5 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 2 of 24
12. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 24
13. (pick-up-crate crate11 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 warehouse)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 2 of 24
14. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 2 of 24
15. (drone-move loc14 loc23 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc23)
   goals met: 2 of 24
16. (drop-crate loc23 person11 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 3 of 24
17. (drone-move loc23 warehouse drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 24
18. (pick-up-crate crate12 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 warehouse)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 3 of 24
19. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 3 of 24
20. (drone-move loc14 loc20 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc20)
   goals met: 3 of 24
21. (drop-crate loc20 person16 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person16 medicine) (empty-arm drone1 right)
   goals met: 4 of 24
22. (drone-move loc20 warehouse drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 24
23. (pick-up-crate crate13 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate13 warehouse)
   added: (has-crate-drone-arm drone1 right crate13)
   goals met: 4 of 24
24. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 4 of 24
25. (drone-move loc14 loc17 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc17)
   goals met: 4 of 24
26. (drop-crate loc17 person20 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate13)
   added: (has-content-person person20 medicine) (empty-arm drone1 right)
   goals met: 5 of 24
27. (drone-move loc17 warehouse drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 24
28. (pick-up-crate crate14 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate14 warehouse)
   added: (has-crate-drone-arm drone1 right crate14)
   goals met: 5 of 24
29. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 5 of 24
30. (drone-move loc14 loc10 drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc10)
   goals met: 5 of 24
31. (drop-crate loc10 person23 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person23 food) (empty-arm drone1 left)
   goals met: 6 of 24
32. (drone-move loc10 warehouse drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 24
33. (pick-up-crate crate2 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 6 of 24
34. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 6 of 24
35. (drop-crate loc14 person1 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 7 of 24
36. (drone-move loc14 warehouse drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 24
37. (pick-up-crate crate3 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 7 of 24
38. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 7 of 24
39. (drop-crate loc14 person1 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate14)
   added: (has-content-person person1 medicine) (empty-arm drone1 right)
   goals met: 8 of 24
40. (drone-move loc14 warehouse drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 24
41. (pick-up-crate crate15 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 warehouse)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 8 of 24
42. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 8 of 24
43. (drop-crate loc2 person2 crate3 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person2 food) (empty-arm drone1 left)
   goals met: 9 of 24
44. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 24
45. (pick-up-crate crate4 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 9 of 24
46. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 9 of 24
47. (drop-crate loc2 person2 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person2 medicine) (empty-arm drone1 right)
   goals met: 10 of 24
48. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 24
49. (pick-up-crate crate16 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate16 warehouse)
   added: (has-crate-drone-arm drone1 right crate16)
   goals met: 10 of 24
50. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 10 of 24
51. (drop-crate loc2 person6 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person6 food) (empty-arm drone1 left)
   goals met: 11 of 24
52. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 24
53. (pick-up-crate crate5 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 11 of 24
54. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 11 of 24
55. (drop-crate loc2 person6 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate16)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 12 of 24
56. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 24
57. (pick-up-crate crate17 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate17 warehouse)
   added: (has-crate-drone-arm drone1 right crate17)
   goals met: 12 of 24
58. (drone-move warehouse loc15 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 12 of 24
59. (drop-crate loc15 person7 crate5 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person7 food) (empty-arm drone1 left)
   goals met: 13 of 24
60. (drone-move loc15 warehouse drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 24
61. (pick-up-crate crate6 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 13 of 24
62. (drone-move warehouse loc15 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 13 of 24
63. (drop-crate loc15 person7 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate17)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 14 of 24
64. (drone-move loc15 warehouse drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 24
65. (pick-up-crate crate18 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate18 warehouse)
   added: (has-crate-drone-arm drone1 right crate18)
   goals met: 14 of 24
66. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 14 of 24
67. (drop-crate loc11 person10 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate18)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 15 of 24
68. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 24
69. (pick-up-crate crate19 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate19 warehouse)
   added: (has-crate-drone-arm drone1 right crate19)
   goals met: 15 of 24
70. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 15 of 24
71. (drop-crate loc11 person12 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person12 food) (empty-arm drone1 left)
   goals met: 16 of 24
72. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 24
73. (pick-up-crate crate7 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 warehouse)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 16 of 24
74. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 16 of 24
75. (drop-crate loc11 person12 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate19)
   added: (has-content-person person12 medicine) (empty-arm drone1 right)
   goals met: 17 of 24
76. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 24
77. (pick-up-crate crate20 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate20 warehouse)
   added: (has-crate-drone-arm drone1 right crate20)
   goals met: 17 of 24
78. (drone-move warehouse loc5 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 17 of 24
79. (drop-crate loc5 person3 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 18 of 24
80. (drone-move loc5 warehouse drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 24
81. (pick-up-crate crate8 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 warehouse)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 18 of 24
82. (drone-move warehouse loc5 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 18 of 24
83. (drone-move loc5 loc3 drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 loc3)
   goals met: 18 of 24
84. (drop-crate loc3 person22 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person22 food) (empty-arm drone1 left)
   goals met: 19 of 24
85. (drop-crate loc3 person18 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate20)
   added: (has-content-person person18 medicine) (empty-arm drone1 right)
   goals met: 20 of 24
86. (drone-move loc3 warehouse drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 24
87. (pick-up-crate crate21 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate21 warehouse)
   added: (has-crate-drone-arm drone1 right crate21)
   goals met: 20 of 24
88. (drone-move warehouse loc5 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 20 of 24
89. (drone-move loc5 loc3 drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 loc3)
   goals met: 20 of 24
90. (drop-crate loc3 person22 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate21)
   added: (has-content-person person22 medicine) (empty-arm drone1 right)
   goals met: 21 of 24
91. (drone-move loc3 warehouse drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 24
92. (pick-up-crate crate22 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate22 warehouse)
   added: (has-crate-drone-arm drone1 right crate22)
   goals met: 21 of 24
93. (drone-move warehouse loc5 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 21 of 24
94. (drop-crate loc5 person3 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate22)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 22 of 24
95. (drone-move loc5 warehouse drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 24
96. (pick-up-crate crate23 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate23 warehouse)
   added: (has-crate-drone-arm drone1 right crate23)
   goals met: 22 of 24
97. (drone-move warehouse loc5 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 22 of 24
98. (drop-crate loc5 person14 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate23)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 23 of 24
99. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 24 of 24
